{
  "tok2id": {
    "C": 110,
    "=": 107,
    "(": 93,
    "c": 168,
    "1": 98,
    "5": 102,
    ")": 94,
    "O": 115,
    "2": 99,
    ".": 96,
    "6": 103,
    "3": 100,
    "8": 105,
    "s": 172,
    "9": 106,
    "n": 169,
    "7": 104,
    "4": 101,
    "N": 114,
    "S": 117,
    "F": 112,
    "#": 2,
    "Cl": 111,
    "Br": 109,
    "o": 170,
    "%12": 5,
    "%10": 3,
    "[nH]": 160,
    "%13": 6,
    "%11": 4,
    "%18": 11,
    "%14": 7,
    "%17": 10,
    "%15": 8,
    "%19": 12,
    "%16": 9,
    "[N+]": 133,
    "[O-]": 139,
    "P": 116,
    "-": 95,
    "%20": 13,
    "%22": 15,
    "%21": 14,
    "%51": 44,
    "%50": 43,
    "%52": 45,
    "%53": 46,
    "%58": 51,
    "%27": 20,
    "%59": 52,
    "%28": 21,
    "%49": 42,
    "%23": 16,
    "%25": 18,
    "%24": 17,
    "%60": 53,
    "%29": 22,
    "%30": 23,
    "%61": 54,
    "%31": 24,
    "%32": 25,
    "%33": 26,
    "%37": 30,
    "%38": 31,
    "%43": 36,
    "%45": 38,
    "%46": 39,
    "%55": 48,
    "%34": 27,
    "%56": 49,
    "%39": 32,
    "%41": 34,
    "%36": 29,
    "%26": 19,
    "%35": 28,
    "%40": 33,
    "%57": 50,
    "%44": 37,
    "%54": 47,
    "%42": 35,
    "%48": 41,
    "%47": 40,
    "I": 113,
    "[N-]": 134,
    "[n+]": 158,
    "[Si]": 152,
    "[S+]": 143,
    "%69": 62,
    "%77": 70,
    "%76": 69,
    "%65": 58,
    "%66": 59,
    "%68": 61,
    "%78": 71,
    "%64": 57,
    "%67": 60,
    "%71": 64,
    "%72": 65,
    "%73": 66,
    "%74": 67,
    "%75": 68,
    "%62": 55,
    "%70": 63,
    "%63": 56,
    "[S-]": 144,
    "[PH]": 142,
    "%79": 72,
    "%81": 74,
    "%80": 73,
    "[Se]": 149,
    "[s+]": 163,
    "%82": 75,
    "%83": 76,
    "%84": 77,
    "B": 108,
    "%86": 79,
    "%85": 78,
    "%87": 80,
    "%91": 84,
    "%88": 81,
    "%89": 82,
    "%90": 83,
    "%93": 86,
    "%92": 85,
    "[P+]": 141,
    "[C-]": 127,
    "[se]": 165,
    "%94": 87,
    "[O]": 140,
    "[BH2-]": 123,
    "%95": 88,
    "%96": 89,
    "%99": 92,
    "%97": 90,
    "%98": 91,
    "0": 97,
    "[o+]": 162,
    "[As]": 120,
    "[c+]": 155,
    "[te+]": 166,
    "[B-]": 121,
    "[n-]": 159,
    "[Te]": 153,
    "p": 171,
    "[O+]": 138,
    "[se+]": 164,
    "[SiH2]": 150,
    "[N]": 137,
    "[SH2]": 145,
    "[te]": 167,
    "[B]": 125,
    "[BH3-]": 124,
    "[cH-]": 157,
    "[CH]": 129,
    "[Se+]": 147,
    "[C+]": 126,
    "[NH-]": 136,
    "[IH2]": 132,
    "[c-]": 156,
    "[C]": 130,
    "[I+]": 131,
    "[As+]": 119,
    "[SeH]": 148,
    "[CH2-]": 128,
    "[n]": 161,
    "[Zn]": 154,
    "[BH-]": 122,
    "[SiH]": 151,
    "[SH]": 146,
    "[NH+]": 135,
    "[AgH3-3]": 118,
    "MASK": 0,
    "PAD": 1
  },
  "id2tok": {
    "110": "C",
    "107": "=",
    "93": "(",
    "168": "c",
    "98": "1",
    "102": "5",
    "94": ")",
    "115": "O",
    "99": "2",
    "96": ".",
    "103": "6",
    "100": "3",
    "105": "8",
    "172": "s",
    "106": "9",
    "169": "n",
    "104": "7",
    "101": "4",
    "114": "N",
    "117": "S",
    "112": "F",
    "2": "#",
    "111": "Cl",
    "109": "Br",
    "170": "o",
    "5": "%12",
    "3": "%10",
    "160": "[nH]",
    "6": "%13",
    "4": "%11",
    "11": "%18",
    "7": "%14",
    "10": "%17",
    "8": "%15",
    "12": "%19",
    "9": "%16",
    "133": "[N+]",
    "139": "[O-]",
    "116": "P",
    "95": "-",
    "13": "%20",
    "15": "%22",
    "14": "%21",
    "44": "%51",
    "43": "%50",
    "45": "%52",
    "46": "%53",
    "51": "%58",
    "20": "%27",
    "52": "%59",
    "21": "%28",
    "42": "%49",
    "16": "%23",
    "18": "%25",
    "17": "%24",
    "53": "%60",
    "22": "%29",
    "23": "%30",
    "54": "%61",
    "24": "%31",
    "25": "%32",
    "26": "%33",
    "30": "%37",
    "31": "%38",
    "36": "%43",
    "38": "%45",
    "39": "%46",
    "48": "%55",
    "27": "%34",
    "49": "%56",
    "32": "%39",
    "34": "%41",
    "29": "%36",
    "19": "%26",
    "28": "%35",
    "33": "%40",
    "50": "%57",
    "37": "%44",
    "47": "%54",
    "35": "%42",
    "41": "%48",
    "40": "%47",
    "113": "I",
    "134": "[N-]",
    "158": "[n+]",
    "152": "[Si]",
    "143": "[S+]",
    "62": "%69",
    "70": "%77",
    "69": "%76",
    "58": "%65",
    "59": "%66",
    "61": "%68",
    "71": "%78",
    "57": "%64",
    "60": "%67",
    "64": "%71",
    "65": "%72",
    "66": "%73",
    "67": "%74",
    "68": "%75",
    "55": "%62",
    "63": "%70",
    "56": "%63",
    "144": "[S-]",
    "142": "[PH]",
    "72": "%79",
    "74": "%81",
    "73": "%80",
    "149": "[Se]",
    "163": "[s+]",
    "75": "%82",
    "76": "%83",
    "77": "%84",
    "108": "B",
    "79": "%86",
    "78": "%85",
    "80": "%87",
    "84": "%91",
    "81": "%88",
    "82": "%89",
    "83": "%90",
    "86": "%93",
    "85": "%92",
    "141": "[P+]",
    "127": "[C-]",
    "165": "[se]",
    "87": "%94",
    "140": "[O]",
    "123": "[BH2-]",
    "88": "%95",
    "89": "%96",
    "92": "%99",
    "90": "%97",
    "91": "%98",
    "97": "0",
    "162": "[o+]",
    "120": "[As]",
    "155": "[c+]",
    "166": "[te+]",
    "121": "[B-]",
    "159": "[n-]",
    "153": "[Te]",
    "171": "p",
    "138": "[O+]",
    "164": "[se+]",
    "150": "[SiH2]",
    "137": "[N]",
    "145": "[SH2]",
    "167": "[te]",
    "125": "[B]",
    "124": "[BH3-]",
    "157": "[cH-]",
    "129": "[CH]",
    "147": "[Se+]",
    "126": "[C+]",
    "136": "[NH-]",
    "132": "[IH2]",
    "156": "[c-]",
    "130": "[C]",
    "131": "[I+]",
    "119": "[As+]",
    "148": "[SeH]",
    "128": "[CH2-]",
    "161": "[n]",
    "154": "[Zn]",
    "122": "[BH-]",
    "151": "[SiH]",
    "146": "[SH]",
    "135": "[NH+]",
    "118": "[AgH3-3]",
    "0": "MASK",
    "1": "PAD"
  }
}